<?php

return [
    'title' => 'Настройки',

    'types' => [
        'shifts'      => 'Смены',
        'departments' => 'Подразделения',
    ],

    'shifts' => [
        'edit_title' => 'Настройка смен',
        'shift'      => 'Номер смены',
        'name'       => 'Название',
        'start'      => 'Начало',
        'end'        => 'Конец',
        'add'        => 'Добавить смену',
        'remove'     => 'Удалить',
    ],

    'departments' => [
        'edit_title' => 'Подразделения',
        'name'       => 'Название',
        'add'        => 'Добавить подразделение',
        'remove'     => 'Удалить',
    ],
];
