<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Мовні ресурси автентифікації
    |--------------------------------------------------------------------------
    |
    | Наступні мовні ресурси використовуються під час автентифікації для
    | різних повідомлень, які ми повинні вивести користувачеві на екран.
    | Ви можете вільно змінювати ці мовні ресурси відповідно
    | до вимог вашої програми.
    |
    */

    'failed'   => 'Невірне ім\'я користувача або пароль.',
    'throttle' => 'Забагато спроб входу. Будь ласка, спробуйте ще раз через :seconds секунд.',

    'form' => [
        'email'    => 'Електронна пошта',
        'email_placeholder'    => 'Введіть вашу електронну адресу',
        'password_placeholder' => 'Введіть ваш пароль',
        'login'    => 'Увійти',
        'register' => 'Зареєструватися',
        'forgot_password' => 'Забули пароль?',
    ],

];
