<?php

return [

    'verify' => [
        'greeting' => 'Привіт',
        'subject' => 'Підтвердити Email для сервісу :name',
        'line' => 'Натисніть кнопку нижче, щоб підтвердити свою електронну адресу.',
        'action' => 'Підтвердити Email',
        'footer_info' => 'Якщо у вас виникли проблеми з натисканням кнопки ":btn_action", скопіюйте та вставте наведену нижче URL-адресу в адресний рядок браузера:',
        'signature' => 'Сервіс :name',
    ],
    'reset_password' => [
        'subject'   => 'Сповіщення про скидання пароля - :name',
        'title'   => ':name скидання пароля',
        'action'    => 'Скинути пароль',
        'h1'  => 'Скинути',
        'h2'  => 'ваш пароль?',
        'text_1'  => 'Перейдіть за посиланням для скидання вашого пароля',
        'text_2'  => 'Інформація',
        'text_3'    => '*** Якщо ви не запитували скидання пароля, жодних подальших дій не потрібно.',
    ],

    'rent_ended' => [
        'subject'   => 'Сповіщення про закінчення оренди для сайту :domain',
        'title'   => 'Сповіщення про закінчення оренди для сайту :domain',
        'action'    => 'Продовжити оренду',
        'text_1'    => 'Закінчується оренда для сайту :domain.',
    ],

];
