<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы напоминания пароля
    |--------------------------------------------------------------------------
    |
    | Последующие языковые строки возвращаются брокером паролей на неудачные
    | попытки обновления пароля в таких случаях, как ошибочный код сброса
    | пароля или неверный новый пароль.
    |
    */

    'reset'     => 'Ваш пароль було скинуто!',
    'sent'      => 'Посилання для скидання пароля було надіслано!',
    'throttled' => 'Будь ласка, зачекайте перед повторною спробою.',
    'token'     => 'Недійсний код скидання пароля.',
    'user'      => 'Не вдалося знайти користувача із вказаною електронною адресою.',

];
