<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Мовні ресурси для перевірки значень
    |--------------------------------------------------------------------------
    |
    | Наступні мовні рядки містять повідомлення за замовчуванням, що використовуються
    | класом, який перевіряє значення (валідатором). Деякі з правил мають
    | кілька версій, наприклад, size. Ви можете змінити їх на будь-які
    | інші, які краще підходять для вашої програми.
    |
    */

    'accepted'        => 'Ви повинні прийняти :attribute.',
    'active_url'      => 'Поле :attribute містить недійсний URL.',
    'after'           => 'У полі :attribute має бути дата пізніше :date.',
    'after_or_equal'  => 'У полі :attribute має бути дата пізніше або дорівнювати :date.',
    'alpha'           => 'Поле :attribute може містити лише літери.',
    'alpha_dash'      => 'Поле :attribute може містити лише літери, цифри, дефіс та нижнє підкреслення.',
    'alpha_num'       => 'Поле :attribute може містити лише літери та цифри.',
    'array'           => 'Поле :attribute має бути масивом.',
    'before'          => 'У полі :attribute має бути дата раніше :date.',
    'before_or_equal' => 'У полі :attribute має бути дата раніше або дорівнювати :date.',
    'between'         => [
        'numeric' => 'Поле :attribute має бути між :min та :max.',
        'file'    => 'Розмір файлу в полі :attribute має бути між :min та :max Кілобайт(а).',
        'string'  => 'Кількість символів у полі :attribute має бути між :min та :max.',
        'array'   => 'Кількість елементів у полі :attribute має бути між :min та :max.',
    ],
    'boolean'        => 'Поле :attribute має мати значення логічного типу.',
    'confirmed'      => 'Поле :attribute не збігається з підтвердженням.',
    'date'           => 'Поле :attribute не є датою.',
    'date_equals'    => 'Поле :attribute має бути датою, що дорівнює :date.',
    'date_format'    => 'Поле :attribute не відповідає формату :format.',
    'different'      => 'Поля :attribute та :other повинні відрізнятися.',
    'digits'         => 'Довжина цифрового поля :attribute має бути :digits.',
    'digits_between' => 'Довжина цифрового поля :attribute має бути між :min та :max.',
    'dimensions'     => 'Поле :attribute має неприпустимі розміри зображення.',
    'distinct'       => 'Поле :attribute містить повторюване значення.',
    'email'          => 'Поле :attribute має бути дійсною електронною адресою.',
    'ends_with'      => 'Поле :attribute має закінчуватися одним із наступних значень: :values',
    'exists'         => 'Вибране значення для :attribute некоректне.',
    'file'           => 'Поле :attribute має бути файлом.',
    'filled'         => 'Поле :attribute обов\'язкове для заповнення.',
    'gt'             => [
        'numeric' => 'Поле :attribute має бути більше :value.',
        'file'    => 'Розмір файлу в полі :attribute має бути більше :value Кілобайт(а).',
        'string'  => 'Кількість символів у полі :attribute має бути більше :value.',
        'array'   => 'Кількість елементів у полі :attribute має бути більше :value.',
    ],
    'gte' => [
        'numeric' => 'Поле :attribute має бути :value або більше.',
        'file'    => 'Розмір файлу в полі :attribute має бути :value Кілобайт(а) або більше.',
        'string'  => 'Кількість символів у полі :attribute має бути :value або більше.',
        'array'   => 'Кількість елементів у полі :attribute має бути :value або більше.',
    ],
    'image'    => 'Поле :attribute має бути зображенням.',
    'in'       => 'Вибране значення для :attribute помилкове.',
    'in_array' => 'Поле :attribute не існує в :other.',
    'integer'  => 'Поле :attribute має бути цілим числом.',
    'ip'       => 'Поле :attribute має бути дійсною IP-адресою.',
    'ipv4'     => 'Поле :attribute має бути дійсною IPv4-адресою.',
    'ipv6'     => 'Поле :attribute має бути дійсною IPv6-адресою.',
    'json'     => 'Поле :attribute має бути JSON рядком.',
    'lt'       => [
        'numeric' => 'Поле :attribute має бути менше :value.',
        'file'    => 'Розмір файлу в полі :attribute має бути менше :value Кілобайт(а).',
        'string'  => 'Кількість символів у полі :attribute має бути менше :value.',
        'array'   => 'Кількість елементів у полі :attribute має бути менше :value.',
    ],
    'lte' => [
        'numeric' => 'Поле :attribute має бути :value або менше.',
        'file'    => 'Розмір файлу в полі :attribute має бути :value Кілобайт(а) або менше.',
        'string'  => 'Кількість символів у полі :attribute має бути :value або менше.',
        'array'   => 'Кількість елементів у полі :attribute має бути :value або менше.',
    ],
    'max' => [
        'numeric' => 'Поле :attribute не може бути більше :max.',
        'file'    => 'Розмір файлу в полі :attribute не може бути більше :max Кілобайт(а).',
        'string'  => 'Кількість символів у полі :attribute не може перевищувати :max.',
        'array'   => 'Кількість елементів у полі :attribute не може перевищувати :max.',
    ],
    'mimes'     => 'Поле :attribute має бути файлом одного з наступних типів: :values.',
    'mimetypes' => 'Поле :attribute має бути файлом одного з наступних типів: :values.',
    'min'       => [
        'numeric' => 'Поле :attribute має бути не менше :min.',
        'file'    => 'Розмір файлу в полі :attribute має бути не менше :min Кілобайт(а).',
        'string'  => 'Кількість символів у полі :attribute має бути не менше :min.',
        'array'   => 'Кількість елементів у полі :attribute має бути не менше :min.',
    ],
    'not_in'               => 'Вибране значення для :attribute помилкове.',
    'not_regex'            => 'Вибраний формат для :attribute помилковий.',
    'numeric'              => 'Поле :attribute має бути числом.',
    'password'             => 'Неправильний пароль.',
    'present'              => 'Поле :attribute повинно бути присутнім.',
    'regex'                => 'Поле :attribute має помилковий формат.',
    'required'             => 'Поле :attribute обов\'язкове для заповнення.',
    'required_if'          => 'Поле :attribute обов\'язкове для заповнення, коли :other дорівнює :value.',
    'required_unless'      => 'Поле :attribute обов\'язкове для заповнення, коли :other не дорівнює :values.',
    'required_with'        => 'Поле :attribute обов\'язкове для заповнення, коли :values вказано.',
    'required_with_all'    => 'Поле :attribute обов\'язкове для заповнення, коли :values вказано.',
    'required_without'     => 'Поле :attribute обов\'язкове для заповнення, коли :values не вказано.',
    'required_without_all' => 'Поле :attribute обов\'язкове для заповнення, коли жодне з :values не вказано.',
    'same'                 => 'Значення полів :attribute та :other повинні збігатися.',
    'size'                 => [
        'numeric' => 'Поле :attribute має дорівнювати :size.',
        'file'    => 'Розмір файлу в полі :attribute має дорівнювати :size Кілобайт(а).',
        'string'  => 'Кількість символів у полі :attribute має дорівнювати :size.',
        'array'   => 'Кількість елементів у полі :attribute має дорівнювати :size.',
    ],
    'starts_with' => 'Поле :attribute має починатися з одного з наступних значень: :values',
    'string'      => 'Поле :attribute має бути рядком.',
    'timezone'    => 'Поле :attribute має бути дійсним часовим поясом.',
    'unique'      => 'Таке значення поля :attribute вже існує.',
    'uploaded'    => 'Завантаження поля :attribute не вдалося.',
    'url'         => 'Поле :attribute має помилковий формат URL.',
    'uuid'        => 'Поле :attribute має бути коректним UUID.',

    /*
    |--------------------------------------------------------------------------
    | Власні мовні ресурси для перевірки значень
    |--------------------------------------------------------------------------
    |
    | Тут Ви можете вказати власні повідомлення для атрибутів.
    | Це дозволяє легко вказати своє повідомлення для заданого правила атрибута.
    |
    | http://laravel.com/docs/validation#custom-error-messages
    | Приклад використання
    |
    |   'custom' => [
    |       'email' => [
    |           'required' => 'Нам необхідно знати Вашу електронну адресу!',
    |       ],
    |   ],
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Власні назви атрибутів
    |--------------------------------------------------------------------------
    |
    | Наступні рядки використовуються для підміни програмних імен елементів
    | користувацького інтерфейсу на зрозуміліші. Наприклад, замість імені
    | поля "email" у повідомленнях буде виводитися "електронна адреса".
    |
    | Приклад використання
    |
    |   'attributes' => [
    |       'email' => 'електронна адреса',
    |   ],
    |
    */

    'attributes' => [
        'name'                  => 'Ім\'я',
        'username'              => 'Нікнейм',
        'email'                 => 'E-Mail адреса',
        'first_name'            => 'Ім\'я',
        'last_name'             => 'Прізвище',
        'password'              => 'Пароль',
        'password_confirmation' => 'Підтвердження пароля',
        'city'                  => 'Місто',
        'country'               => 'Країна',
        'address'               => 'Адреса',
        'phone'                 => 'Телефон',
        'mobile'                => 'Моб. номер',
        'age'                   => 'Вік',
        'sex'                   => 'Стать',
        'gender'                => 'Стать',
        'day'                   => 'День',
        'month'                 => 'Місяць',
        'year'                  => 'Рік',
        'hour'                  => 'Година',
        'minute'                => 'Хвилина',
        'second'                => 'Секунда',
        'title'                 => 'Найменування',
        'content'               => 'Контент',
        'description'           => 'Опис',
        'excerpt'               => 'Витяг',
        'date'                  => 'Дата',
        'time'                  => 'Час',
        'available'             => 'Доступно',
        'size'                  => 'Розмір',
    ],
];
